## Staging: secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 5 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                               NAME                               |
|----------|------------------------------------------------------------------|
| update   | `aws_secretsmanager_secret.freshdesk_api_key`                    |
|          | `aws_secretsmanager_secret.notify_api_key`                       |
|          | `aws_secretsmanager_secret.notify_callback_bearer_token`         |
|          | `aws_secretsmanager_secret.recaptcha_secret`                     |
|          | `aws_secretsmanager_secret.token_secret`                         |
| recreate | `aws_secretsmanager_secret_version.notify_callback_bearer_token` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret.freshdesk_api_key will be updated in-place
  ~ resource "aws_secretsmanager_secret" "freshdesk_api_key" {
        id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:freshdesk_api_key-JVyxop"
        name                           = "freshdesk_api_key"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.notify_api_key will be updated in-place
  ~ resource "aws_secretsmanager_secret" "notify_api_key" {
        id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_api_key-eR3nNp"
        name                           = "notify_api_key"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.notify_callback_bearer_token will be updated in-place
  ~ resource "aws_secretsmanager_secret" "notify_callback_bearer_token" {
        id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_callback_bearer_token-aXJPLs"
        name                           = "notify_callback_bearer_token"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.recaptcha_secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "recaptcha_secret" {
        id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:recaptcha_secret-tTjsBo"
        name                           = "recaptcha_secret"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.token_secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "token_secret" {
        id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:token_secret-n5Doyu"
        name                           = "token_secret"
      ~ tags                           = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.notify_callback_bearer_token must be replaced
-/+ resource "aws_secretsmanager_secret_version" "notify_callback_bearer_token" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_callback_bearer_token-aXJPLs" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:notify_callback_bearer_token-aXJPLs|4A43D97C-2937-4E91-A924-ADF60955E459" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "4A43D97C-2937-4E91-A924-ADF60955E459" -> (known after apply)
      ~ version_stages = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.freshdesk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_callback_bearer_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.recaptcha_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.token_secret"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
